["They work very well. Easy to clean, we wash them in the dishwasher every day. Our LO loves to hold on to the bottle and the plastic covering makes it easy for her to hold on to.", "it came early and was not disappointed. i love planet wise bags and now my wipe holder. it keps my osocozy wipes moist and does not leak. highly recommend it.", "I ended up with a variety of different brands of cotton flannel baby wipes.  These are good quality, just not my personal favorite.  However, if the colors really do it for you, go ahead and stock up on these, they're good.  And really, we're talking squares of flannel, it's not critical.  For what it's worth, I like BumGenius wipes best for absorbency - like wiping up spit-up.  They're thick and soft.  I like OsoCozy best for cleaning baby bums, because they're thin, the better to clean crevices with.  ALL the wipes I bought shrank a lot in the first wash (hot), so expect that.I avoided GroVia for being synthetic, but in retrospect that might have been the way to go.  I have all BumGenius 4.0 diapers, which shouldn't be washed with natural fibers.  Now I have to wash the cotton wipes with baby's clothes, rather than with the diapers, which isn't ideal.", "These flannel wipes are OK, but in my opinion not worth keeping.  I also ordered someImse Vimse Cloth Wipes-Ocean Blue-12 countwhich are larger, had a nicer, softer texture and just seemed higher quality.  I use cloth wipes for hands and faces and have been usingThirsties 6 Pack Fab Wipes, Boyfor about 8 months now and need to replace them because they are starting to get rough and have had stink issues for a while that stripping no longer handles.", "Cute quilt, the colors are perfect and my little girl loves it...but I wish the quality was a little better.", "Very soft and comfortable and warmer than it looks...fit the full size bed perfectly...would recommend to anyone looking for this type of quilt", "Some children don't give up their pacifier easily. In fact, it can be downright traumatic! The Binky Fairy makes the transition easier for both the child and the mom. Cute and cuddly, The Binky Fairy will become a much-loved toy!", "This is a product well worth the purchase.  I have not found anything else like this, and it is a positive, ingenious approach to losing the binky.  What I love most about this product is how much ownership my daughter has in getting rid of the binky.  She is so proud of herself, and loves her little fairy.  I love the artwork, the chart in the back, and the clever approach of this tool.", "This book is amazing!  I bought it and read it to my daughter for a month.  Then we painted a little cardboard box and I had her put all her paci's in it.  We then put the box on the front porch.  The next morning when she woke up we went out to the front porch to find Beatrice (the finger puppet from the book) and a small gift.  We never looked back.  We didn't even need to use the stickers.  It has been 6 months now and it has worked like a charm! My kids are 15 months apart so my son will be next and I plan to purchase the Fireman version for him.  Thank you!!!", "I bought this with high hopes of it actually working to get my 2 year old daughter off of her pacifier. While she really likes the book, I don't think it's going to work. I went in her room in the night to deliver the pacifier fairy and take the pacifier and she woke up SCREAMING for her pacifier before I even left the room. This does not have any real support or tips for parents. We will keep reading the book and try again, but not thinking it will work for us.", "Most parents are aware that both Pediatricians and Dentists agree that prolonged pacifier and thumb sucking can affect a child's teeth.  In order to avoid seriously problems, parents have to make sure the habits are stopped at the appropriate time.  It was difficult getting my oldest daughter to give up her binkies when she was younger.  I definitely could have used a Binky Fairy to help!  Reading the Binky Fairy book and teaching my kids about the Binky Fairy, confirms how great it really is!  I love the positive way it teaches kids to stop the problem versus \\\"DON'T SUCK YOUR THUMB!\\\"  It was great and makes the process a lot easier and kid-friendly!", "All of my kids have cried non-stop when I tried to ween them off their pacifier, until I found Thumbuddy To Love's Binky Fairy Puppet.  It is an easy way to work with your kids to allow them to understand where their pacifier is going and help them part from it.This is a must buy book, and a great gift for expecting parents!!  You will save them soo many headaches.Thanks for this book!  You all rock!!", "This is such a great product...My husband and I were wondering how we were going to get our little one to stop pacifier sucking and the Binky Fairy made it so easy. It explained to her where the paci's go and that the Binky Fairy would come and leave a puppet of her as a thank you! My girl was so excited to wake up to find a Binky Fairy puppet and she was not at all upset to leave her paci's behind. This is a great product not only for the children but for the parents as well! Phew! Thank you!! (By the way, this product can be for boys or girls since it is gender neutral.", "disappointed that the book and puppet were so small and the content of the story wasn't that appealing to me,  not at all whay I expectedfeel the same about 'Fireman Fred'", "When the Binky Fairy came to our house, we didn't have any special gift and book to help explain to her about how important it is to stop using a pacifier. This book does a great job to help prepare your child for the loss of their favorite item. The doll is adorable and we made lots of cute movies with the Binky Fairy telling our daughter about what happens when the Binky Fairy comes. I would highly recommend this product for any parent trying to break the pacifier or thumb sucking habit.", "I really like these pacifiers.  My daughter only really liked the Soothies from the hospital, and these are the same shape.  The best difference is that these have a hole to attach a pacifier clip so she won't lose them.  And the cute argyle clip that came with this order is perfect!  I highly recommend these if your baby likes the Soothies that the hospital uses.", "I have this nook and I love it. But this priceIis not worth it. You can get it for more than HALF this price at B&N!! What arip off!", "Its a unisex baby memory book. It has that vintage look on the outside n inside. I love it! Has everything covered from moms side to dads side to mile stones thru the babies toddler days its a very nice book! We had seen it at barnes n nobles when we first found out we were expecting n never seen it since so i did some research n found it here for actually a cheaper price! :)))", "Lovely book, it's bound tightly so you may not be able to add alot of photos/cards aside from the designated spaces in the book. Shop around before you purchase, as it is currently listed at Barnes & Noble for 29.95!", "Perfect for new parents. We were able to keep track of baby's feeding, sleep and diaper change schedule for the first two and a half months of her life. Made life easier when the doctor would ask questions about habits because we had it all right there!", "We have used this product since our daughter was born and diagnosed with a disease that req'd tracking of medicines and food and treatments every day...three years later we still use and love it.", "I love the journal,it is a great way to record a child's food intake, output, sleep, and other activities during the day.  I wish it was called &#34;Daily Childcare Journal&#34; Instead of Baby Tracker as I use it for 3 months to up to 4 year olds, so the word &#34;Baby&#34; doesn't always fit.  However, besides that...it is perfect.  I also wish the publisher offered a discount for larger orders (say 5 or more)!", "This book is such a life saver.  It has been so helpful to be able to go back to track trends, answer pediatrician questions, or communicate with each other when you are up at different times of the night with a newborn.  I think it is one of those things that everyone should be required to have before they leave the hospital.  We went through all the pages of the newborn version, then moved to the infant version, and will finish up the second infant book (third total) right as our baby turns 1.  See other things that are must haves for baby at [...]", "I love this book as a way to track my child's daily routine. it's great for other caregivers to be able to record things.", "Every new mom needs this journal.  The 24 hour calendar/schedule keeps tracks of everything I do with my newborn, which is essential in the first few months, but also great after that as you learn your baby's routine and establish a schedule.  I love this journal and wish I had one for my first child.  I already bought another journal to use when this one runs out.  Perfect tool!", "I was a bit hesitant at first to buy the notebook.  First, I thought it would be a waste of money.  I was considering just having our nanny jot down all the times/notes in a regular notebook or some sheet of paper.  But it's nice to have everything all in one place and fun to go back and see the patterns that have developed.  I also didn't know whether the format was user-friendly.  I had imagined something more along the lines of activity (e.g., food or sleep) and then empty boxes below for the nanny to jot down time and info (e.g., 10am sweet potato or 11am down for nap).  But the notebook format works well and it presents a great \\\"map\\\" of what the day was like.  Will definitely recommend this product to friends and family.", "I'm on my 4th one of these (second baby).  I have my nanny fill it out every day so I can come home to see what my children have eaten and when they napped.  It's a simple, no fuss, use friendly lay out that makes using it a breeze.  It has space for all relevant information and an extra comments/notes section on the bottom for anything additional.", "A friend of mine pinned this product on Pinterest so I decided to give it a whirl! It is fantastic! If you are a new parent, this will help you keep track of feedings, diaper changes and the like!", "Helps me know exactly how my babies day has gone with my mother in law watching him while I go to work.  It also has a section for her to write notes and let me know anything she may need.  I couldn't be happier with this book.", "I bought this a few times for my older son and have bought it again for my newborn. This is super easy to use and helps me keep track of his daily routine. When he started going to the sitter when I went back to work, it helped me know how his day went to better prepare me for how the evening would most likely go. When he was sick, it help me keep track of how many diapers a day he was producing to make sure he was getting dehydrated. The note sections to the side and bottom are useful too because his sitter writes in small notes about whether or not he liked his lunch or if the playtime included going for a walk, etc.Excellent for moms who are wanting to keep track of their kids daily routine even though they are at work. Excellent for dads to keep track as my husband can quickly forget what time he fed our son. LOL", "This is a great way to keep track of everything you would want to know about your baby/child throughout the course of a day.  We love this because our nanny can keep notes for us to see at the end of the day, and we can look for trends over time.  It's really easy to use short-hand thanks to the formatted page, and everything fits nicely on one page.  There's even room left at the bottom to leave notes about first words, new teeth, etc.  If you're a stickler for details, you'll love this.  If your child is younger and still not sleeping through the night, check out the version of this book that provides one page for day and one page for night - we used that when ours was an infant.", "I wanted an alternative to printing out daily log sheets for the nanny to fill out, and this has worked out great! I'm no longer searching my daughter's bag for a crumpled piece of paper each day. It's also nice to be able to look back on previous days and weeks for eating and sleeping patterns. I would have preferred a plastic-type cover, but it's held up well so far.", "This is great for basics, but I wish the space to write things in was bigger. A lot times I need struggle trying to read what the caretaker wrote in because the spaces go together.", "This has been an easy way for my nanny to record all the key events that happen with my baby when I'm not at home.  Would highly recommend it to someone who wants to stay informed of what your baby is up to while you're not home.The only reason this isn't a 5 is because I think there could have been some more standarad pre-printed options.I plan on ordering another one when we run out of pages in this journal.", "I love this journal and our nanny uses it everyday to track on our daughter's sleep, eating and other activities. The layout and design make it very easy to fill in quickly with a comments column to add in details (i.e. we ask the nanny to specify what food she had for lunch, amount of milk she took, specifics of play time--tummy time, walk to park, etc.) I love knowing the details of my baby's day, and I also use it to track weekly on overall schedule patterns and changes (i.e. baby's nap time has moved naturally as she gets older).My only complaint is that there is no real space to communicate back to the nanny, as I sometimes want to reply to the nanny's comments and/or leave her notes about the previous night (i.e. Baby didn't sleep well or baby has rash, etc) or other instructions (Please use sun screen on the baby - it's hot out today) that I often forget to tell her in the rush of the morning. I just stick in post-its now for my notes. All in all, I highly recommend this baby tracker.", "As a regular babysitter and nanny, I buy one of these for all of my clients. It's the perfect way to keep track of baby's day without having to try to remember it all. I love the comment section for recording new milestones, and parents use it as a place to jot down questions to ask at the next visit to the pediatrician.", "My 3 month old son spend half of his days with my mother and half with a neighbor while I worked.  I had them track his activity (loosely) in this which allowed me to get an idea of how his schedule was developing and how much milk he was eating.  It was the best way to have some cohesion in his life while I was at work.", "This book is perfect!  I'm a first time new mom, and this book made it so easy to keep track of feedings, diaper changes, sleep.  Definitely would recommend this for new moms.  Plus it's small enough that I throw in the diaper back for doctor visits.", "This has been a great tool for use with our nanny.  She is able to keep track of what they do all day; which helps me feel more connected and &#34;in the loop.&#34;  It's also nice on the days I am here in the morning and she comes in the afternoon; I just jot down what we've been doing so she doesn't have to call me with questions (like when did he eat last; did you give any tylenol today; etc).  Easy to use format with some flexibility; we also use it as our nanny's time card.", "This book/ tracker is very convenient and easy to use. It keeps all the improtnat information right at ur fingertips!", "I wanted to love this, but it was pretty expensive for only a few months worth of calendar pages.  I ended up buying a regular weekly planner - 55% OFF! - The Planner - that is 8 1/2 x 11 and has all seven days on the right page and the left page has room to write a To Do List and Goals.  I found this to be more helpful because I could mark each day's eating and sleeping blocks, then also see them side by side - I could see her patterns more easily with a weekly view.  This planner was cute, just not what I wanted.", "We use this with our nanny, and she is so good about filling it out everyday.  We've brought it along to our doctor appointments when we have had concerns about constipation, and food issues as well.  I've reordered this over and over :)", "My daughter will be 18 months this week and we've been using this log since our sitter started at 3 months.  It has room for everything but isn't too complicated or time consuming.  The book is good for about 6 months. Keeps me organized. Love it!", "My baby's time is split up between a home daycare, my husband, and myself. It is hard for all of us to keep track of when baby last ate, peed, pooped, slept, etc, etc UNTIL NOW! This book has solved all of that. At the end of the day I can very easily see how my daughter's day went and I can look over the days past to see if there is any concern. Or when she is sick I can keep track of how she's doing with that too. There are comments spots on each line for little notes such as how many ounces she drank, but then there is a bigger comment box below where daycare leaves me a little note everyday, \\\"lots of smiles today\\\" or \\\"she likes the new bottle much better.\\\" Each day goes from 6 to 6. So I use the left side for 6pm to 6am and then the right side for 6AM to 6PM. But you could just track days if you wanted to. I do both since that way daycare can also see how her night went and if they should be \\\"prepared\\\" for an interesting day ahead!I highly recommend this for all mom's heading back to work! It's one last thing you need to worry about when dropping off your baby, it's all right there for daycare to read and for you to read at the end of the day. And on a side note, it's super cute too! :)", "I originally just gave the nanny a pad of paper to write down this information for my little one. She would take him to the park and leave the pad behind - I was getting incomplete/inaccurate information when she wohld get home at the end of the day and try to remember naps/feedings/diaper changes. I wanted something she could take with her and also a way to better control how she reported information. This was the perfect solution! Now I'm getting all the information I wanted. There is a very helpful example of how to fill it out. It also has a pouch for additional documents and a section up front for emergency contact info. Each page goes from 7 - 6. This works for me because the nanny starts at 7am and ends before 6pm. I use an app on my phone for tracking when I'm with the baby. I transfer the info from this notebook to my phone. My only complaint: the space is pretty small - they provide useful shorthand, but it's a little difficult to fit some of the info in the space provided. Also, some of the other reviews complain about the 7 - 6 time format. This isn't a real problem for me, but I suppose if you wanted to track an entire day, you would have to use two pages - not too big of a deal. 7am - 6pm is pretty much perfect for daycare/nanny/caregiver situation.", "this is a MUST have for anyone using a nanny or home daycare for an infant.  it's also a great way to communicate between mommy, daddy and sitter.  you have the ability to look back at patterns and schedules and also track when the baby is fussy. i've used it for 8 months now and i really don't think i could live without it.", "The Baby Tracker brand books are the absolute best of the trackers that are available. You can track naps, feedings, diaper changes, activities, and notes. They're easy to use and have a nice clean layout.I started using the Newborn Baby Tracker, which tracks nights and days. It gave me a nice way to track feedings and note important milestones. Once I used up the entire book, I bought this Baby Tracker, which tracks only days since my daughter is sleeping during the night now. Her caregiver notes her activities and sleeping times during the day. It's a great way for me to know what happened. Plus, it's nice to be able to look back and see patterns or trends.", "This journal is a great way to track your babies' day. It has all the information you need in one location. Easy to use and very self explanatory. I would highly recommend it for any new parent.", "During your postpartum stay at the hospital the nurses will ask you to keep a log of your baby's feedings, urination and bowel movements. However, when you get home you do not have a nurse to remind you or ask when your baby's last bowel movement was and you are so overwhelmed with the new schedule you can't even remember what day it is. The daily tracker helped us so much because once we got home our baby cried all the time, could not sleep and we were having major problems breastfeeding. It was so bad we had to contact our pediatrician's after hours on-call doctor. Looking at the tracker we realized a trend, the baby was not feeding for a long time AND we had very few wet diapers and bowel movements. This was an indication our baby was dehydrated and the doctor suggested we start pumping breast milk (to see how much we get) and supplement with formula until sufficient breast milk finally came in. The feeding column we wrote how many ounces of breast milk or formula we gave and how long he breast fed for. In the comments column we use it for tracking how much water I drink because I was not drinking enough to make an adequate supply of breastmilk. For a while I wasn't sure what was giving him horrible gas, so I started to track what I ate in case it was a food allergy (we have a peanut allergy in the family). We even write notes about his first smile, who came to visit, ect to keep in his memory box.", "I use this so that our babysitter (grandma) can keep track of what goes on during the day.  We've recorded so many milestones since we received this.  It is a 6 month diary and has room for notes.  I wish the hours started around 6 am and went until 8 pm, but we just write over certain times to suit our purposes. The nice thing is that if we had a rough night and we are super tired, we have something to refer to if we forgot when we last fed the baby or when he woke up. I also like that the front page has a place for emergency comments and a consent form in case your child needs medical care.  It also has a place at the back of the book for immunizations.  I'll definitely get another one in 6 months when we finish this book.", "This book is a great way for keeping track of daily changing and feedings.  My only wish is that it was in a 24 hour format.  But other than that it is great.", "This is the second time o bought this journal. I bought one with my first baby and loved it. So as soon as I was pregnant with my second child I ordered another one. I'm loving it once again.  This journal is a great way to keep track of all your newborns information during the first three critical months; everything from feedings, changes, baths, etc.", "Has columns for all the info I need at a glance when I get home from work. Nanny is able to fill it out easily....love it", "I like this log, but think it would work better with clearer AM & PM sections. Each page is 12 hours so you really need two pages a day if your baby feeds or wets a lot in the early morning hours between midnight and 7am. We're cramming those in to the 2 blank spaces above 7am right now.", "My wife and I have a six month old baby boy and around the 4-month mark my wife decided that she would return to work instead of being a stay-at-home mom. We hired an in-home nanny to care for our little boy and the arrangement has worked quite well ever since. Shortly after starting the arrangement we realized that we would need some sort of journal to track our little boy's activities while he was with the nanny and we were working. We used a plain notebook for a period of weeks until we stumbled on the Baby Tracker - Daily Childcare Journal.--------------------LAYOUT AND USE:The Baby Tracker is really an excellent idea. The journal pages are clearly divided into columns for tracking feedings, nap-time, diaper changes, play-time as well as general areas for notes and tracking milestones. The legibility in the Baby Tracker is a huge improvement over our standard notebook entries that really ended up becoming small paragraphs. In a few short moments you can summarize all of the data in the columns in the totals section and determine key information - how much did baby eat, did baby have a bowel movement, how much sleep did they get, etc.There are, however, some frustrating limitations with this journal. First the entire layout is about half a notebook sheet divided down the middle (portrait layout). This constrains entries to very small spaces on each column and row. For much of the information that is okay - feedings can be summarized in ounces; diaper changes by a &#34;#1 or #2&#34; and so on. However, once your baby becomes more active and you'd like to know more than &#34;tummy time&#34; under the play-time column things start to get very tight on the page.Another problem is that this tracker only covers 12 hours out of a baby's day. That's fine if the intention is only to track hours while a baby is with child care providers. However, we really wanted to track our little boy's entire day which often starts much earlier than 6am. Using this journal that would require the use of a second page.--------------------WHAT I LIKE ABOUT THE BABY TRACKER:(+) Good layout that is easy to read and instantly gather information about your baby's day in a matter of moments(+) High quality paper(+) Consistent quality between the pages--------------------WHAT I DON'T LIKE ABOUT THE BABY TRACKER:(-) Expensive and gets you at most 6-months, less if you use more than one page for tracking your babies entire day(-) The cover is thick but not a hardback and bends easily in a diaper bag(-) The pages should really be bigger. I understand portability is a concern but the current size is entirely too small--------------------CONCLUSION:I ended up making my own format of this journal in a spreadsheet that includes a 24-hour day and more space for comments along with a few other changes and had the pages bound cheaply at a local shop. This is an adequate journal but expensive for what you get and limitations because of page size.", "I really love this book because it helps me to better understand the needs of my baby.  He cries less and is in better health.  When I'm at work my husband can easily see what has been done and what needs to be done with our baby.", "I thought keeping a simple handwritten journal would be nice.  But I haven't used this thing at all, and here's why:1.) When you're breastfeeding, it's often nice to have your phone close by so that you can keep yourself entertained.  If you are able to grab *both* your phone and this notebook - and a pen - consistently - and at 3 in the morning - you are more skilled than me.  (I don't nurse in the same place every time.)2.) You're also often so sleep deprived that - at least for me - I'd forget to look at what time we started on a side, or what side we started on.  I'm not perfect with the app I have either, but at least I just have to mindlessly hit a button.3.) I really like the app I have (Baby Connect).  It gives me better data.  For example, it can tell me how long on average feedings have been taking (helpful as we start to think about sleep training).  It can tell me that I nursed him 177 times last month (granted that serves no useful purpose other than a feeling of perverse satisfaction).", "I like this, although I wish I would have bought the one that tracks the whole day into the night for my infant. This one is perfect for childcare providers, though.", "This is a great book. I bought it for our nanny to use. We used to use single sheet print-outs for our first kid. But this time around, this book keeps it all nice and compact, in one place. it has columns for feeding, diaper changes, comments, baby needs. Serves the purpose and you can track you baby's daily progress.", "Great product. Lots of room for diaper change, feeding, and sleep info, but not enough room for notes. Activities would be a nice area to add.", "We have (and love) the other log book Time Too makes. I was enticed by the lure of a six month log, because three months was not quite enough for us (six months might not be either).The other book runs from 5:30am to 5:30pm on one page, and 5:30pm to 5:30am on the next. This version inexplicably runs from 6am to 7pm on one page and from 6pm to 7am on the next, so the 6am-7am and 6pm-7pm hour blocks appear on both pages.The other book provides only a 24 hour total, whereas this one provides a blank for totals every 12 hours, and the narrow formfactor is nicer, but we may return it because of the repetition of the time block.", "I rarely buy anything without feedback, but I think this was on sale for $2 so I took a chance. There is no story at all, just three words on each page - silly names for each twin. I do think that very young babies might enjoy the black and white pictures, so it would probably be a cute shower gift for an expectant mother of twins, or newborn twins. But my 18 month old twins are not interested at all.", "This book was not what I expected. I thought it would be fun since we have twin girls, but it was boring and had no storyline at all.", "this was the second baby's first year i purchased and i am very pleased with it. it has 13 months, so you can record your baby's first birthday- love the family tree, cute stickers and place for pictures! very nice!", "Space for monthly photos, info and a lot of useful stickers come with it. It is exactly what I wanted!!", "If you don't write it down right away you will forget. Having a calendar I could make quick notes the day new things happened then go back to write more about it in my scrapbooks.", "I have bought this calendar for 2 of my kids now and I love it. It is so sweet and playful. The stickers included are cute and it gives lots of spacefor pictures.", "This is a good calendar. I suggest getting the extra stickers. Great way to easily record milestones. Good price too.", "This book really allows a lot of personalization and customization! I wish it had a book to go with it.", "I did one of these for all 3 of my children. Being the youngest of three myself I wanted to make sure that they all of mine had an equivalent baby book and I knew I could handle doing a calendar. Great way to record the first year.", "I ordered several calendars, since the descriptions and photos were not very helpful. I gave this calendar a four because I will be returning it due to the divorced grandparents issue below, which does not apply to everyone.I did not remove the shrink wrap on this calendar, so my review is based on the back cover. My issue with the calendar, and the reason it will be returned, is because of the format of the Family Tree page, which is pictured on the cover. There are spaces for grandmother and grandfather instead of grandparents, which does not work well if the grandparents are divorced. You would only be able to include the biological grandparents, which does not accurately depict the family that the child knew as they were growing up.The calendar contains (per the back cover):- Humorous journal prompts (I love to watch, my favorite place to visit, etc.) and space for a large photo.- You write in the month and year, so none of the 81 stickers are &#34;wasted&#34; on month titles.- Birth announcement and family tree pages.", "I bought this calender for myself for my second son. It is very colorful and has room on each page to write height, weight, and what baby likes to do. There is also room on each page for a photo to be placed. The calender date boxes have room for a sticker and some fine writing. My only complaint is that it does not have as many stickers as I would like, but I just put asterisks before whatever special event happened that day. I bought one for a friend as she found it very useful as well.", "this is a really cute calendar to keep track of baby's first year. I purchased one for my nephew and it is great to keep track of all his firsts. I also purchased the 2nd year calendar.", "I bought this as a present for my friend who just had her second child.  She told me she loves it and is very excited about it.  With her first child she lost track of when her daughter did what, and she is sure it will be more complicated having a 4 year old and a newborn.  This calendar will at least save the date of the event so she can fill in details for the baby book later.", "I love this little calender, you can keep track of all of baby's firsts. I like the illustrations, and the stickers too.", "I have been so busy with my baby girl, I realized I never reviewed this transaction! I am super happy with this product!!! It is sooo convenient & easy to use!! I had something similar with my other 2 daughter's but I like this one the best!! I love that I could purchase the 2 year with it as well! :) It arrived fast too!! Good price as well! :)", "I was so happy to find a second year calendar.  The graphics are very cute and I'm very happy with it.  Great service from Easy Baby Memories", "My daughter loved it.  It was great to find two years worth of calendaring and stickers to boot.  Thank you very much.", "I really liked the additional stickers for the coordinating calendar. They add a few extra options not available on the calendar.", "These stickers are a great addition to any first or second year calendar you are doing for your child.  Lots of mile stones that are different from the stick sets that come with most calendars.", "I bought these for me and a friend for our baby's first year calendars. Some of them are great, &#34;sick day,&#34; &#34;first play date,&#34; while others are for toddlers and will never go on a first year calendar. Fair since the title is first and second year stickers, but I don't know of any second year calendars. Would've rather had more first year stickers.", "I wanted the ease of just using stickers to record events and memories, but the quality of these stickers is very poor.  Looks like someone tried to print them out on their inkjet printer.  Sayings are cute like \\\"my first tantrum\\", "These are a good supplement to the sticker calenders I have purchased for grandchildren in the past.  However, they were not protected or wrapped so some of the corners were pushed up from the backing.", "it's in the water at work and everyone seems to be conceiving. i bought several baby calendars and these stickers for shower presents. as an old parent with undone baby books this is the way to go. new moms don't get it. you think you'll have time to pull out that book and document daily happenings. you get lost.  put a baby calendar on the fridge have the extra stickers, bookmark your day and the memory will be there always. remember most great accomplishments are in the first year. spend your time with your child.", "Could have better lables", "I use this for my daughters second year.  I love the stickers that I can use to mark her accomplishments.", "This calendar is perfect for those moms that wish to continue recording their child's milestones. Nice blocks for adding memories.", "This was the only calender I could find for the second year. I did one for the first and wanted to continue cause there are so many things to note still after they turn 1. This one was better than the first year one I got him.", "I completed a calendar for my son's first year and really enjoyed tracking all of his milestones and special moments - so much so that I wanted to continue in the second year since he's still doing amazing and fun things every day.  I really like the simple layout of the calendar and while it might not have all the questions and milestone stickers you want - at least it's something to keep recording all those special moments!", "I bought my son 1st and 2nd year calendars because I thought it would be easier to jot down day to day things...We are almost at the end of this 2nd year one and love it!  It has places for pictures and cute little sayings or memories.  I'm really happy with it!!", "We wanted to get something to keep track of our child's milestones and this is a cute option. There aren't many other choices out there and this does exactly what we wanted.", "I had a hard time finding a second year calendar, this is the only one I came across and it is great!  Large enough to write in the squares and has a spot to put that month's picture in as well as some memories. The first two years they change so much I like to jot everything down so I can keep track of all the big milestones...and little ones!  I find it is easier to do this on a calendar vs a baby book.  This way you can fill out the baby book later and have a great reference to do so!", "This was the only calendar for my baby's second year that I could find. I like that it has holiday and milestone stickers that come with it. I especially like how each month has a space for my own photos. Overall a great calendar but it would be nice to have other style options for backgrounds.", "This beautifully-illustrated calendar is an amazing time saver. As a busy mom, I appreciate being able to use the stickers and then go back and write in additional notes and put in monthly pictures of my little girl. I also recommend the Nature's Lullabies First Year calendar. They are great together!", "I only purchased a second-year calendar for my son because I had one for my daughter. I was really disappointed with the lack of selection available for second-year calendars in general, so I just got this one because it was one of the only ones. It's an okay calendar. The finish on the pages is glossy which makes it hard to write on with certain pens. The stickers aren't very cute and the pages are pretty old-fashioned looking. Hopefully they will come out with some other calendars for future purchasers.", "It was hard to find a second year calendar and my daughter-in-law who is a busy working mom enjoyed the first year calendar so much. I was thrilled to find this. A nice way to keep up with those milestones and there are so many in year two. She keeps it near the fridge and jots on it often. This is a great gift for any mom with a toddler. Is there a year three?", "There are few options for a second year calendar, but this is the one I chose to purchase. I was not overly impressed with the cover design, but it serves its purpose of documenting memories.", "This was a very good buy and it contained stickers of certain 1st, like walking, running, etc..  And there was enough room to write things of your own.", "I LOVE this calendar for recording events of my son's second year of life.  There are plenty of 1st year baby calendars out there and I loved reocording events of his first year and didn't want to just stop now that he is one.  Nature's lullabies second year calendar is perfect for continuing on with daily record keeping.  The stickers are wonderful and helped me think of milestones to record that I might not have thought of on my own.  I highly recommend this calendar!  Plus it's super cute and brat for either gender.", "I love it. I'm not the journaling type, so hanging this on tbe baby's door made it simple for me. I have to walk past it Once I put him to bed in his crib, so I just stop, write a little something about the day and move on. The whole first year was captured like that and now year two will be as well!"]